sdaiIsValidationCurrent(Sdai_instS*)
\details
Checks if any SDAI-models were added or removed to the schema instance since last validation and last validation was successful.
\param schemaInstance [in] A schema instance.
\returns
* sdaiTRUE if the constraint is satisfied and last validation result was true.
* sdaiFALSE if the constraint is violated or last validation result was not true.